Documents/ЛБ_ПриходОтходовДМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЛБ_ПриходОтходовДМ</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЛБ_ДвижениеОтходов</xr:Item>
				<xr:Item>AccumulationRegister.ЛБ_ОтходыДМВПути</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВесОбщий</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВесТары</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВесБезТары</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БезТары</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тара</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Тара</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛомбардОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыОперацийОтходыДМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументПеремещения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_РасходОтходовДМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДокументаПеремещения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерНакладнойПеремещения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ЛБ_ОтходыДМВПути.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЛБ_ОтходыДМВПути</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВесНетто</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛомбардОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СкладОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛомбардПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СкладПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПеремещения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_РасходОтходовДМ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ЛБ_ПриходОтходовДМ/Forms/ФормаВПути/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Форма") Тогда
		Если Параметры.Форма = "Документ" Тогда
			Список.ТекстЗапроса = "ВЫБРАТЬ
			                      |	ЛБ_ОтходыДМВПутиОстатки.ЛомбардОтправитель КАК ЛомбардОтправитель,
			                      |	ЛБ_ОтходыДМВПутиОстатки.СкладОтправитель КАК СкладОтправитель,
			                      |	ЛБ_ОтходыДМВПутиОстатки.ЛомбардПолучатель КАК ЛомбардПолучатель,
			                      |	ЛБ_ОтходыДМВПутиОстатки.СкладПолучатель КАК СкладПолучатель,
			                      |	ЛБ_ОтходыДМВПутиОстатки.ВесНеттоОстаток КАК ВесНеттоОстаток,
			                      |	ЛБ_ОтходыДМВПутиОстатки.ДокументПеремещения КАК ДокументПеремещения,
			                      |	ЛБ_ОтходыДМВПутиОстатки.ДокументПеремещения.Дата КАК ДокументПеремещенияДата,
			                      |	ЛБ_ОтходыДМВПутиОстатки.ДокументПеремещения.НомерНакладной КАК ДокументПеремещенияНомерНакладной,
			                      |	ЛБ_ОтходыДМВПутиОстатки.ДокументПеремещения.Ответственный КАК ДокументПеремещенияОтветственный,
			                      |	ЛБ_ОтходыДМВПутиОстатки.ДокументПеремещения.Комментарий КАК ДокументПеремещенияКомментарий
			                      |ИЗ
			                      |	РегистрНакопления.ЛБ_ОтходыДМВПути.Остатки(
			                      |			,
			                      |			ЛомбардОтправитель = &ЛомбардОправитель
			                      |				И СкладОтправитель = &СкладОтправитель
			                      |				И ЛомбардПолучатель = &ЛомбардПолучатель
			                      |				И СкладПолучатель = &СкладПолучатель) КАК ЛБ_ОтходыДМВПутиОстатки";
			
			Список.Параметры.УстановитьЗначениеПараметра("ЛомбардОправитель", Параметры.ЛомбардОтправитель);
			Список.Параметры.УстановитьЗначениеПараметра("ЛомбардПолучатель", Параметры.ЛомбардПолучатель);
			Список.Параметры.УстановитьЗначениеПараметра("СкладОтправитель", Параметры.СкладОтправитель);
			Список.Параметры.УстановитьЗначениеПараметра("СкладПолучатель", Параметры.СкладПолучатель);
			
			ЭтаФорма.Заголовок = "Выбор документа перемещения";
		КонецЕсли;
		
		Если Параметры.Форма = "Журнал" Тогда
			Если Параметры.Свойство("Ломбард") Тогда
				Список.ТекстЗапроса = "ВЫБРАТЬ
									|	ЛБ_ОтходыДМВПутиОстатки.ЛомбардОтправитель КАК ЛомбардОтправитель,
									|	ЛБ_ОтходыДМВПутиОстатки.СкладОтправитель КАК СкладОтправитель,
									|	ЛБ_ОтходыДМВПутиОстатки.ЛомбардПолучатель КАК ЛомбардПолучатель,
									|	ЛБ_ОтходыДМВПутиОстатки.СкладПолучатель КАК СкладПолучатель,
									|	ЛБ_ОтходыДМВПутиОстатки.ВесНеттоОстаток КАК ВесНеттоОстаток,
									|	ЛБ_ОтходыДМВПутиОстатки.ДокументПеремещения КАК ДокументПеремещения,
									|	ЛБ_ОтходыДМВПутиОстатки.ДокументПеремещения.Дата КАК ДокументПеремещенияДата,
									|	ЛБ_ОтходыДМВПутиОстатки.ДокументПеремещения.НомерНакладной КАК ДокументПеремещенияНомерНакладной,
									|	ЛБ_ОтходыДМВПутиОстатки.ДокументПеремещения.Ответственный КАК ДокументПеремещенияОтветственный,
									|	ЛБ_ОтходыДМВПутиОстатки.ДокументПеремещения.Комментарий КАК ДокументПеремещенияКомментарий
									|ИЗ
									|	РегистрНакопления.ЛБ_ОтходыДМВПути.Остатки(
									|			,
									|			ЛомбардОтправитель В (&Ломбард)
									|				ИЛИ ЛомбардПолучатель В (&Ломбард)) КАК ЛБ_ОтходыДМВПутиОстатки";
				
				Список.Параметры.УстановитьЗначениеПараметра("Ломбард", Параметры.Ломбард);
			Иначе
				Список.ТекстЗапроса = "ВЫБРАТЬ
									|	ЛБ_ОтходыДМВПутиОстатки.ЛомбардОтправитель КАК ЛомбардОтправитель,
									|	ЛБ_ОтходыДМВПутиОстатки.СкладОтправитель КАК СкладОтправитель,
									|	ЛБ_ОтходыДМВПутиОстатки.ЛомбардПолучатель КАК ЛомбардПолучатель,
									|	ЛБ_ОтходыДМВПутиОстатки.СкладПолучатель КАК СкладПолучатель,
									|	ЛБ_ОтходыДМВПутиОстатки.ВесНеттоОстаток КАК ВесНеттоОстаток,
									|	ЛБ_ОтходыДМВПутиОстатки.ДокументПеремещения КАК ДокументПеремещения,
									|	ЛБ_ОтходыДМВПутиОстатки.ДокументПеремещения.Дата КАК ДокументПеремещенияДата,
									|	ЛБ_ОтходыДМВПутиОстатки.ДокументПеремещения.НомерНакладной КАК ДокументПеремещенияНомерНакладной,
									|	ЛБ_ОтходыДМВПутиОстатки.ДокументПеремещения.Ответственный КАК ДокументПеремещенияОтветственный,
									|	ЛБ_ОтходыДМВПутиОстатки.ДокументПеремещения.Комментарий КАК ДокументПеремещенияКомментарий
									|ИЗ
									|	РегистрНакопления.ЛБ_ОтходыДМВПути.Остатки(, ) КАК ЛБ_ОтходыДМВПутиОстатки";
			КонецЕсли;
			
			ЭтаФорма.Заголовок = "Просмотр перемещений в пути";
			Элементы.Выбрать.Видимость = Ложь;
			Элементы.Выбрать.Доступность = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	ТекСтр = Элементы.Список.ТекущиеДанные;
	ЭтаФорма.Закрыть(ТекСтр.ДокументПеремещения);
КонецПроцедуры
